{
  "defaults": {
    "authors": "plu5",
    "issues": "https://github.com/plu5/p-borderlands/issues",
    "versions": {
      "1.1.0 2021-05-17": "https://github.com/plu5/p-borderlands/releases/tag/v1.1.1",
      "1.0.0 2021-04-21": "https://github.com/plu5/p-borderlands/releases/tag/v1.1.0",
      "1.0.0": "https://github.com/plu5/p-borderlands/releases/tag/v1.0.0"
    },
    "supports": [
      "BL2"
    ]
  },
  "mods": [
    {
      "name": "Sprint Adjuster",
      "description": [
        "- Change speed when sprinting, while preserving normal speed when not sprinting.\n",
        "- Optionally set Air Control to allow better control in the air with the movement keys, to have a better chance of stopping yourself from flinging off a cliff for instance.\n",
        "- Configurable keybinding to allow turning on and off on the fly."
      ],
      "tagline": "Change sprinting speed.",
      "types": [
        "Utility"
      ],
      "latest": "1.1.0 2021-05-17",
      "source": "https://github.com/plu5/p-borderlands/blob/main/SprintAdjuster"
    },
    {
      "name": "Exp Adjuster",
      "description": [
        "Adds sliders to adjust XP amounts:\n",
        "- baserates for each mode,\n",
        "- as well as multipliers based on level difference from killed enemies.\n",
        "\n",
        "By default all the values are set to what they are normally. Check Options -> Mods menu to adjust them."
      ],
      "tagline": "Sliders to adjust XP amounts on the fly.",
      "types": [
        "Utility"
      ],
      "latest": "1.0.0",
      "source": "https://github.com/plu5/p-borderlands/blob/main/ExpAdjuster"
    },
    {
      "name": "Saves Backuper",
      "description": [
        "Back up the contents of your saves folder each time you launch the game.\n",
        "- You can set the number of backups that will be kept, to keep them below a certain threshold.\n",
        "- You can set which folder to back up and where to back up to.\n",
        "\n\n",
        "UserFeedback is required, make sure you remember to install that too.",
        "\n\n",
        "Usage:\n",
        "- On first enable, the paths configuration panel will pop up. There are some guesses made on where your SaveData folder might be. Status will tell you whether they are valid. Verify they are the paths you want or modify them as you see fit.\n",
        "- On subsequent launches, the mod will be enabled automatically and save a backup, and no action is required. The panel will not pop up again unless there is a problem with the paths. You can open it manually by pressing C in the mod manager.\n",
        "- By default, the number of backups to keep is set to 5. After this number is exceeded, the oldest one will be deleted. You can customise this behaviour in Options -> Mods.\n",
        "\n",
        "There is pretty good logging in this mod. You can check what’s going on by looking at the console or log (in `/Binaries/Win32/python-sdk.log`).",
        "\n\n",
        "More information is available on the [README](https://github.com/plu5/p-borderlands/tree/main/SavesBackuper)."
      ],
      "tagline": "Back up the contents of your saves folder each time you launch the game.",
      "types": [
        "Utility"
      ],
      "latest": "1.0.0 2021-04-21",
      "source": "https://github.com/plu5/p-borderlands/blob/main/SavesBackuper",
      "requirements": {
        "UserFeedback": ">=1.5"
      }
    }
  ]
}
